renesas/fsp/ra/fsp/src/bsp/cmsis/Device/RENESAS/Include/R7FA0L107.h
        struct
        {
            __IM uint32_t IF0  : 1;    /*!< [0..0] Interrupt Request Flag Monitor                                     */
            __IM uint32_t IF1  : 1;    /*!< [1..1] Interrupt Request Flag Monitor                                     */
            __IM uint32_t IF2  : 1;    /*!< [2..2] Interrupt Request Flag Monitor                                     */
            __IM uint32_t IF3  : 1;    /*!< [3..3] Interrupt Request Flag Monitor                                     */
            __IM uint32_t IF4  : 1;    /*!< [4..4] Interrupt Request Flag Monitor                                     */
            __IM uint32_t IF5  : 1;    /*!< [5..5] Interrupt Request Flag Monitor                                     */
            __IM uint32_t IF6  : 1;    /*!< [6..6] Interrupt Request Flag Monitor                                     */
            __IM uint32_t IF7  : 1;    /*!< [7..7] Interrupt Request Flag Monitor                                     */
            __IM uint32_t IF8  : 1;    /*!< [8..8] Interrupt Request Flag Monitor                                     */
            __IM uint32_t IF9  : 1;    /*!< [9..9] Interrupt Request Flag Monitor                                     */
            __IM uint32_t IF10 : 1;    /*!< [10..10] Interrupt Request Flag Monitor                                   */
            __IM uint32_t IF11 : 1;    /*!< [11..11] Interrupt Request Flag Monitor                                   */
            __IM uint32_t IF12 : 1;    /*!< [12..12] Interrupt Request Flag Monitor                                   */
            __IM uint32_t IF13 : 1;    /*!< [13..13] Interrupt Request Flag Monitor                                   */
            __IM uint32_t IF14 : 1;    /*!< [14..14] Interrupt Request Flag Monitor                                   */
            __IM uint32_t IF15 : 1;    /*!< [15..15] Interrupt Request Flag Monitor                                   */
            __IM uint32_t IF16 : 1;    /*!< [16..16] Interrupt Request Flag Monitor                                   */
            __IM uint32_t IF17 : 1;    /*!< [17..17] Interrupt Request Flag Monitor                                   */
            __IM uint32_t IF18 : 1;    /*!< [18..18] Interrupt Request Flag Monitor                                   */
            __IM uint32_t IF19 : 1;    /*!< [19..19] Interrupt Request Flag Monitor                                   */
            __IM uint32_t IF20 : 1;    /*!< [20..20] Interrupt Request Flag Monitor                                   */
            __IM uint32_t IF21 : 1;    /*!< [21..21] Interrupt Request Flag Monitor                                   */
            __IM uint32_t IF22 : 1;    /*!< [22..22] Interrupt Request Flag Monitor                                   */
            __IM uint32_t IF23 : 1;    /*!< [23..23] Interrupt Request Flag Monitor                                   */
            __IM uint32_t IF24 : 1;    /*!< [24..24] Interrupt Request Flag Monitor                                   */
            __IM uint32_t IF25 : 1;    /*!< [25..25] Interrupt Request Flag Monitor                                   */
            __IM uint32_t IF26 : 1;    /*!< [26..26] Interrupt Request Flag Monitor                                   */
            __IM uint32_t IF27 : 1;    /*!< [27..27] Interrupt Request Flag Monitor                                   */
            __IM uint32_t IF28 : 1;    /*!< [28..28] Interrupt Request Flag Monitor                                   */
            __IM uint32_t IF29 : 1;    /*!< [29..29] Interrupt Request Flag Monitor                                   */
            __IM uint32_t IF30 : 1;    /*!< [30..30] Interrupt Request Flag Monitor                                   */
            __IM uint32_t IF31 : 1;    /*!< [31..31] Interrupt Request Flag Monitor                                   */
        } INTFLAG_b[2];
    };
    __IM uint32_t RESERVED13[2];

    union
    {
        __IOM uint32_t SBYEDCR0;           /*!< (@ 0x00000340) Software Standby/Snooze End Control Register
                                            *                  0                                                          */

        struct
        {
            __IOM uint32_t IWDTED : 1;     /*!< [0..0] IWDT Interrupt Software Standby/Snooze Mode Returns Enable         */
            __IOM uint32_t LVD1ED : 1;     /*!< [1..1] LVD1 Interrupt Software Standby/Snooze Mode Returns Enable         */
            __IOM uint32_t IRQ0ED : 1;     /*!< [2..2] IRQ0ED                                                             */
            __IOM uint32_t IRQ1ED : 1;     /*!< [3..3] IRQ1ED                                                             */
            __IOM uint32_t IRQ2ED : 1;     /*!< [4..4] IRQ2ED                                                             */
            __IOM uint32_t IRQ3ED : 1;     /*!< [5..5] IRQ3ED                                                             */
            __IOM uint32_t IRQ4ED : 1;     /*!< [6..6] IRQ4ED                                                             */
            __IOM uint32_t IRQ5ED : 1;     /*!< [7..7] IRQ5ED                                                             */
            __IOM uint32_t IRQ6ED : 1;     /*!< [8..8] IRQ6ED                                                             */
            __IOM uint32_t IRQ7ED : 1;     /*!< [9..9] IRQ7ED                                                             */
            __IOM uint32_t DTCED  : 1;     /*!< [10..10] DTC Transfer Complete Interrupt Snooze Mode Returns
                                            *   Enable                                                                    */
            uint32_t                 : 7;
            __IOM uint32_t SPI00RXED : 1;  /*!< [18..18] SPI00 Transfer End or Buffer Empty Interrupt Snooze
                                            *   Mode Returns Enable                                                       */
            uint32_t                  : 1;
            __IOM uint32_t UART0ERRED : 1; /*!< [20..20] UART0 Reception Communication Error Occurrence Interrupt
                                            *   Snooze Mode Returns Enable                                                */
            uint32_t               : 5;
            __IOM uint32_t IICA0ED : 1;    /*!< [26..26] IICA0 Address Match Interrupt Software Standby/Snooze
                                            *   Mode Returns Enable                                                       */
            __IOM uint32_t UART0RXED : 1;  /*!< [27..27] UART0 Reception Transfer End Interrupt Snooze Mode
                                            *   Returns Enable                                                            */
            uint32_t               : 3;
            __IOM uint32_t ADC12ED : 1;    /*!< [31..31] End of A/D Conversion Interrupt Snooze Mode Returns
                                            *   Enable                                                                    */
        } SBYEDCR0_b;
    };

    union
    {
        __IOM uint32_t SBYEDCR1;        /*!< (@ 0x00000344) Software Standby/Snooze End Control Register
                                         *                  1                                                          */

        struct
        {
            __IOM uint32_t RTCED : 1;   /*!< [0..0] RTC Interrupt Software Standby/Snooze Mode Returns Enable          */
            __IOM uint32_t ITLED : 1;   /*!< [1..1] Interval Signal of 32-bit Interval Timer Interrupt Software
                                         *   Standby/Snooze Mode Returns Enable                                        */
            uint32_t              : 5;
            __IOM uint32_t URE0ED : 1;  /*!< [7..7] UARTA0 Reception Communication Error Interrupt Software
                                         *   Standby/Snooze Mode Returns Enable                                        */
            __IOM uint32_t UT0ED : 1;   /*!< [8..8] UARTA0 Transmission Transfer End or Buffer Empty Interrupt
                                         *   Software Standby/Snooze Mode Returns Enable                               */
            __IOM uint32_t UR0ED : 1;   /*!< [9..9] UARTA0 Reception Transfer End Interrupt Software Standby/Snooze
                                         *   Mode Returns Enable                                                       */
            __IOM uint32_t IICA1ED : 1; /*!< [10..10] IICA1 Address Match Interrupt Software Standby/Snooze
                                         *   Mode Returns Enable                                                       */
            __IOM uint32_t URE1ED : 1;  /*!< [11..11] UARTA1 Reception Communication Error Interrupt Software
                                         *   Standby/Snooze Mode Returns Enable                                        */
            __IOM uint32_t UT1ED : 1;   /*!< [12..12] UARTA1 Transmission Transfer End or Buffer Empty Interrupt
                                         *   Software Standby/Snooze Mode Returns Enable                               */
            __IOM uint32_t UR1ED : 1;   /*!< [13..13] UARTA1 Reception Transfer End Interrupt Software Standby/Snooze
                                         *   Mode Returns Enable                                                       */
            uint32_t              : 2;
            __IOM uint32_t CTSUED : 1;  /*!< [16..16] CTSU Measurement End Interrupt Snooze Mode Returns
                                         *   Enable                                                                    */
            uint32_t : 15;
        } SBYEDCR1_b;
    };
} R_ICU_Type;                           /*!< Size = 840 (0x348)                                                        */

/* =========================================================================================================================== */
/* ================                                          R_IICA0                                          ================ */
/* =========================================================================================================================== */

/**
 * @brief Serial Interface IICA0 (R_IICA0)
 */

typedef struct                         /*!< (@ 0x400A3000) R_IICA0 Structure                                          */
{
    __IOM uint8_t IICA0;               /*!< (@ 0x00000000) IICA Shift Register 0                                      */

    union
    {
        __IM uint8_t IICS0;            /*!< (@ 0x00000001) IICA Status Register 0                                     */

        struct
        {
            __IM uint8_t SPD  : 1;     /*!< [0..0] Detection of stop condition                                        */
            __IM uint8_t STD  : 1;     /*!< [1..1] Detection of start condition                                       */
            __IM uint8_t ACKD : 1;     /*!< [2..2] Detection of acknowledge (ACK)                                     */
            __IM uint8_t TRC  : 1;     /*!< [3..3] Detection of transmit and receive status                           */
            __IM uint8_t COI  : 1;     /*!< [4..4] Detection of matching addresses                                    */
            __IM uint8_t EXC  : 1;     /*!< [5..5] Detection of extension code reception                              */
            __IM uint8_t ALD  : 1;     /*!< [6..6] Detection of arbitration loss                                      */
            __IM uint8_t MSTS : 1;     /*!< [7..7] Master status check flag                                           */
        } IICS0_b;
    };

    union
    {
        __IOM uint8_t IICF0;           /*!< (@ 0x00000002) IICA Flag Register 0                                       */

        struct
        {
            __IOM uint8_t IICRSV : 1;  /*!< [0..0] Communication reservation function disable bit                     */
            __IOM uint8_t STCEN  : 1;  /*!< [1..1] Initial start enable trigger                                       */
            uint8_t              : 4;
            __IM uint8_t IICBSY  : 1;  /*!< [6..6] I2C bus status flag                                                */
            __IM uint8_t STCF    : 1;  /*!< [7..7] IICCTL00.STT clear flag                                            */
        } IICF0_b;
    };
    __IM uint8_t RESERVED[253];

    union
    {
        __IOM uint8_t IICCTL00;        /*!< (@ 0x00000100) IICA Control Register 00                                   */

        struct
        {
            __IOM uint8_t SPT  : 1;    /*!< [0..0] Stop condition trigger                                             */
            __IOM uint8_t STT  : 1;    /*!< [1..1] Start condition trigger                                            */
            __IOM uint8_t ACKE : 1;    /*!< [2..2] Acknowledgment control                                             */
            __IOM uint8_t WTIM : 1;    /*!< [3..3] Control of clock stretching and interrupt request generation       */
            __IOM uint8_t SPIE : 1;    /*!< [4..4] Enable and disable generation of interrupt request when
                                        *   stop condition is detected                                                */
            __IOM uint8_t WREL : 1;    /*!< [5..5] Release from the clock stretch state                               */
            __IOM uint8_t LREL : 1;    /*!< [6..6] Exit from communications                                           */
            __IOM uint8_t IICE : 1;    /*!< [7..7] I2C operation enable                                               */
        } IICCTL00_b;
    };

    union
    {
        __IOM uint8_t IICCTL01;        /*!< (@ 0x00000101) IICA Control Register 01                                   */

        struct
        {
            __IOM uint8_t PRS : 1;     /*!< [0..0] IICA operation clock (fMCK)                                        */
            uint8_t           : 1;
            __IOM uint8_t DFC : 1;     /*!< [2..2] Digital filter operation control                                   */
            __IOM uint8_t SMC : 1;     /*!< [3..3] Operation mode switching                                           */
            __IM uint8_t  DAD : 1;     /*!< [4..4] Detection of SDAA0 pin level (valid only when IICCTL00.IICE
                                        *   = 1)                                                                      */
            __IM uint8_t CLD : 1;      /*!< [5..5] Detection of SCLA0 pin level (valid only when IICCTL00.IICE
                                        *   = 1)                                                                      */
            __IOM uint8_t SVADIS : 1;  /*!< [6..6] Control of address match wakeup                                    */
            __IOM uint8_t WUP    : 1;  /*!< [7..7] IICCTL00.STT clear flag                                            */
        } IICCTL01_b;
    };
    __IOM uint8_t IICWL0;              /*!< (@ 0x00000102) IICA Low-level Width Setting Register 0                    */
    __IOM uint8_t IICWH0;              /*!< (@ 0x00000103) IICA High-level Width Setting Register 0                   */

    union
    {
        __IOM uint8_t SVA0;            /*!< (@ 0x00000104) Slave Address Register 0                                   */

        struct
        {
            uint8_t         : 1;
            __IOM uint8_t A : 7;       /*!< [7..1] 7-bit local address when in slave mode of unit 0                   */
        } SVA0_b;
    };
} R_IICA0_Type;                        /*!< Size = 261 (0x105)                                                        */

/* =========================================================================================================================== */
/* ================                                          R_IWDT                                           ================ */
/* =========================================================================================================================== */

/**
 * @brief Independent Watchdog Timer (R_IWDT)
 */

typedef struct                         /*!< (@ 0x40044400) R_IWDT Structure                                           */
{
    union
    {
        __IOM uint8_t IWDTRR;          /*!< (@ 0x00000000) IWDT Refresh Register                                      */

        struct
        {
            __IOM uint8_t IWDTRR : 8;  /*!< [7..0] The counter is refreshed by writing 0x00 and then writing
                                        *   0xFF to this register.                                                    */
        } IWDTRR_b;
    };
    __IM uint8_t RESERVED;

    union
    {
        __IOM uint16_t IWDTCR;         /*!< (@ 0x00000002) IWDT Control Register                                      */

        struct
        {
            __IOM uint16_t TOPS : 2;   /*!< [1..0] Timeout Period Selection                                           */
            uint16_t            : 2;
            __IOM uint16_t CKS  : 4;   /*!< [7..4] Clock Division Ratio Selection                                     */
            __IOM uint16_t RPES : 2;   /*!< [9..8] Window End Position Selection                                      */
            uint16_t            : 2;
            __IOM uint16_t RPSS : 2;   /*!< [13..12] Window Start Position Selection                                  */
            uint16_t            : 2;
        } IWDTCR_b;
    };

    union
    {
        __IOM uint16_t IWDTSR;          /*!< (@ 0x00000004) IWDT Status Register                                       */

        struct
        {
            __IM uint16_t  CNTVAL : 14; /*!< [13..0] Down-Counter Value                                                */
            __IOM uint16_t UNDFF  : 1;  /*!< [14..14] Underflow Flag                                                   */
            __IOM uint16_t REFEF  : 1;  /*!< [15..15] Refresh Error Flag                                               */
        } IWDTSR_b;
    };

    union
    {
        __IOM uint8_t IWDTRCR;         /*!< (@ 0x00000006) IWDT Reset Control Register                                */

        struct
        {
            uint8_t               : 7;
            __IOM uint8_t RSTIRQS : 1; /*!< [7..7] Reset Interrupt Request Selection                                  */
        } IWDTRCR_b;
    };
    __IM uint8_t RESERVED1;

    union
    {
        __IOM uint8_t IWDTCSTPR;       /*!< (@ 0x00000008) IWDT Count Stop Control Register                           */

        struct
        {
            uint8_t              : 7;
            __IOM uint8_t SLCSTP : 1;  /*!< [7..7] Sleep-Mode Count Stop Control                                      */
        } IWDTCSTPR_b;
    };
    __IM uint8_t  RESERVED2;
    __IM uint16_t RESERVED3;
} R_IWDT_Type;                         /*!< Size = 12 (0xc)                                                           */

/* =========================================================================================================================== */
/* ================                                          R_MSTP                                           ================ */
/* =========================================================================================================================== */

/**
 * @brief System-Module Stop (R_MSTP)
 */

typedef struct                          /*!< (@ 0x40047000) R_MSTP Structure                                           */
{
    union
    {
        __IOM uint32_t MSTPCRA;         /*!< (@ 0x00000000) Module Stop Control Register A                             */

