renesas/fsp/ra/fsp/src/bsp/cmsis/Device/RENESAS/Include/R7FA0L107.h
/* =========================================================  IRQCR  ========================================================= */
 #define R_ICU_IRQCR_FLTEN_Pos            (7UL)          /*!< FLTEN (Bit 7)                                         */
 #define R_ICU_IRQCR_FLTEN_Msk            (0x80UL)       /*!< FLTEN (Bitfield-Mask: 0x01)                           */
 #define R_ICU_IRQCR_FCLKSEL_Pos          (4UL)          /*!< FCLKSEL (Bit 4)                                       */
 #define R_ICU_IRQCR_FCLKSEL_Msk          (0x30UL)       /*!< FCLKSEL (Bitfield-Mask: 0x03)                         */
 #define R_ICU_IRQCR_IRQMD_Pos            (0UL)          /*!< IRQMD (Bit 0)                                         */
 #define R_ICU_IRQCR_IRQMD_Msk            (0x3UL)        /*!< IRQMD (Bitfield-Mask: 0x03)                           */
/* =========================================================  NMISR  ========================================================= */
 #define R_ICU_NMISR_SPEST_Pos            (12UL)         /*!< SPEST (Bit 12)                                        */
 #define R_ICU_NMISR_SPEST_Msk            (0x1000UL)     /*!< SPEST (Bitfield-Mask: 0x01)                           */
 #define R_ICU_NMISR_BUSMST_Pos           (11UL)         /*!< BUSMST (Bit 11)                                       */
 #define R_ICU_NMISR_BUSMST_Msk           (0x800UL)      /*!< BUSMST (Bitfield-Mask: 0x01)                          */
 #define R_ICU_NMISR_BUSSST_Pos           (10UL)         /*!< BUSSST (Bit 10)                                       */
 #define R_ICU_NMISR_BUSSST_Msk           (0x400UL)      /*!< BUSSST (Bitfield-Mask: 0x01)                          */
 #define R_ICU_NMISR_RECCST_Pos           (9UL)          /*!< RECCST (Bit 9)                                        */
 #define R_ICU_NMISR_RECCST_Msk           (0x200UL)      /*!< RECCST (Bitfield-Mask: 0x01)                          */
 #define R_ICU_NMISR_RPEST_Pos            (8UL)          /*!< RPEST (Bit 8)                                         */
 #define R_ICU_NMISR_RPEST_Msk            (0x100UL)      /*!< RPEST (Bitfield-Mask: 0x01)                           */
 #define R_ICU_NMISR_NMIST_Pos            (7UL)          /*!< NMIST (Bit 7)                                         */
 #define R_ICU_NMISR_NMIST_Msk            (0x80UL)       /*!< NMIST (Bitfield-Mask: 0x01)                           */
 #define R_ICU_NMISR_OSTST_Pos            (6UL)          /*!< OSTST (Bit 6)                                         */
 #define R_ICU_NMISR_OSTST_Msk            (0x40UL)       /*!< OSTST (Bitfield-Mask: 0x01)                           */
 #define R_ICU_NMISR_VBATTST_Pos          (4UL)          /*!< VBATTST (Bit 4)                                       */
 #define R_ICU_NMISR_VBATTST_Msk          (0x10UL)       /*!< VBATTST (Bitfield-Mask: 0x01)                         */
 #define R_ICU_NMISR_LVD2ST_Pos           (3UL)          /*!< LVD2ST (Bit 3)                                        */
 #define R_ICU_NMISR_LVD2ST_Msk           (0x8UL)        /*!< LVD2ST (Bitfield-Mask: 0x01)                          */
 #define R_ICU_NMISR_LVD1ST_Pos           (2UL)          /*!< LVD1ST (Bit 2)                                        */
 #define R_ICU_NMISR_LVD1ST_Msk           (0x4UL)        /*!< LVD1ST (Bitfield-Mask: 0x01)                          */
 #define R_ICU_NMISR_WDTST_Pos            (1UL)          /*!< WDTST (Bit 1)                                         */
 #define R_ICU_NMISR_WDTST_Msk            (0x2UL)        /*!< WDTST (Bitfield-Mask: 0x01)                           */
 #define R_ICU_NMISR_IWDTST_Pos           (0UL)          /*!< IWDTST (Bit 0)                                        */
 #define R_ICU_NMISR_IWDTST_Msk           (0x1UL)        /*!< IWDTST (Bitfield-Mask: 0x01)                          */
 #define R_ICU_NMISR_TZFST_Pos            (13UL)         /*!< TZFST (Bit 13)                                        */
 #define R_ICU_NMISR_TZFST_Msk            (0x2000UL)     /*!< TZFST (Bitfield-Mask: 0x01)                           */
 #define R_ICU_NMISR_CPEST_Pos            (15UL)         /*!< CPEST (Bit 15)                                        */
 #define R_ICU_NMISR_CPEST_Msk            (0x8000UL)     /*!< CPEST (Bitfield-Mask: 0x01)                           */
/* =========================================================  NMIER  ========================================================= */
 #define R_ICU_NMIER_SPEEN_Pos            (12UL)         /*!< SPEEN (Bit 12)                                        */
 #define R_ICU_NMIER_SPEEN_Msk            (0x1000UL)     /*!< SPEEN (Bitfield-Mask: 0x01)                           */
 #define R_ICU_NMIER_BUSMEN_Pos           (11UL)         /*!< BUSMEN (Bit 11)                                       */
 #define R_ICU_NMIER_BUSMEN_Msk           (0x800UL)      /*!< BUSMEN (Bitfield-Mask: 0x01)                          */
 #define R_ICU_NMIER_BUSSEN_Pos           (10UL)         /*!< BUSSEN (Bit 10)                                       */
 #define R_ICU_NMIER_BUSSEN_Msk           (0x400UL)      /*!< BUSSEN (Bitfield-Mask: 0x01)                          */
 #define R_ICU_NMIER_RECCEN_Pos           (9UL)          /*!< RECCEN (Bit 9)                                        */
 #define R_ICU_NMIER_RECCEN_Msk           (0x200UL)      /*!< RECCEN (Bitfield-Mask: 0x01)                          */
 #define R_ICU_NMIER_RPEEN_Pos            (8UL)          /*!< RPEEN (Bit 8)                                         */
 #define R_ICU_NMIER_RPEEN_Msk            (0x100UL)      /*!< RPEEN (Bitfield-Mask: 0x01)                           */
 #define R_ICU_NMIER_NMIEN_Pos            (7UL)          /*!< NMIEN (Bit 7)                                         */
 #define R_ICU_NMIER_NMIEN_Msk            (0x80UL)       /*!< NMIEN (Bitfield-Mask: 0x01)                           */
 #define R_ICU_NMIER_OSTEN_Pos            (6UL)          /*!< OSTEN (Bit 6)                                         */
 #define R_ICU_NMIER_OSTEN_Msk            (0x40UL)       /*!< OSTEN (Bitfield-Mask: 0x01)                           */
 #define R_ICU_NMIER_VBATTEN_Pos          (4UL)          /*!< VBATTEN (Bit 4)                                       */
 #define R_ICU_NMIER_VBATTEN_Msk          (0x10UL)       /*!< VBATTEN (Bitfield-Mask: 0x01)                         */
 #define R_ICU_NMIER_LVD2EN_Pos           (3UL)          /*!< LVD2EN (Bit 3)                                        */
 #define R_ICU_NMIER_LVD2EN_Msk           (0x8UL)        /*!< LVD2EN (Bitfield-Mask: 0x01)                          */
 #define R_ICU_NMIER_LVD1EN_Pos           (2UL)          /*!< LVD1EN (Bit 2)                                        */
 #define R_ICU_NMIER_LVD1EN_Msk           (0x4UL)        /*!< LVD1EN (Bitfield-Mask: 0x01)                          */
 #define R_ICU_NMIER_WDTEN_Pos            (1UL)          /*!< WDTEN (Bit 1)                                         */
 #define R_ICU_NMIER_WDTEN_Msk            (0x2UL)        /*!< WDTEN (Bitfield-Mask: 0x01)                           */
 #define R_ICU_NMIER_IWDTEN_Pos           (0UL)          /*!< IWDTEN (Bit 0)                                        */
 #define R_ICU_NMIER_IWDTEN_Msk           (0x1UL)        /*!< IWDTEN (Bitfield-Mask: 0x01)                          */
 #define R_ICU_NMIER_TZFEN_Pos            (13UL)         /*!< TZFEN (Bit 13)                                        */
 #define R_ICU_NMIER_TZFEN_Msk            (0x2000UL)     /*!< TZFEN (Bitfield-Mask: 0x01)                           */
 #define R_ICU_NMIER_CPEEN_Pos            (15UL)         /*!< CPEEN (Bit 15)                                        */
 #define R_ICU_NMIER_CPEEN_Msk            (0x8000UL)     /*!< CPEEN (Bitfield-Mask: 0x01)                           */
/* ========================================================  NMICLR  ========================================================= */
 #define R_ICU_NMICLR_SPECLR_Pos          (12UL)         /*!< SPECLR (Bit 12)                                       */
 #define R_ICU_NMICLR_SPECLR_Msk          (0x1000UL)     /*!< SPECLR (Bitfield-Mask: 0x01)                          */
 #define R_ICU_NMICLR_BUSMCLR_Pos         (11UL)         /*!< BUSMCLR (Bit 11)                                      */
 #define R_ICU_NMICLR_BUSMCLR_Msk         (0x800UL)      /*!< BUSMCLR (Bitfield-Mask: 0x01)                         */
 #define R_ICU_NMICLR_BUSSCLR_Pos         (10UL)         /*!< BUSSCLR (Bit 10)                                      */
 #define R_ICU_NMICLR_BUSSCLR_Msk         (0x400UL)      /*!< BUSSCLR (Bitfield-Mask: 0x01)                         */
 #define R_ICU_NMICLR_RECCCLR_Pos         (9UL)          /*!< RECCCLR (Bit 9)                                       */
 #define R_ICU_NMICLR_RECCCLR_Msk         (0x200UL)      /*!< RECCCLR (Bitfield-Mask: 0x01)                         */
 #define R_ICU_NMICLR_RPECLR_Pos          (8UL)          /*!< RPECLR (Bit 8)                                        */
 #define R_ICU_NMICLR_RPECLR_Msk          (0x100UL)      /*!< RPECLR (Bitfield-Mask: 0x01)                          */
 #define R_ICU_NMICLR_NMICLR_Pos          (7UL)          /*!< NMICLR (Bit 7)                                        */
 #define R_ICU_NMICLR_NMICLR_Msk          (0x80UL)       /*!< NMICLR (Bitfield-Mask: 0x01)                          */
 #define R_ICU_NMICLR_OSTCLR_Pos          (6UL)          /*!< OSTCLR (Bit 6)                                        */
 #define R_ICU_NMICLR_OSTCLR_Msk          (0x40UL)       /*!< OSTCLR (Bitfield-Mask: 0x01)                          */
 #define R_ICU_NMICLR_VBATTCLR_Pos        (4UL)          /*!< VBATTCLR (Bit 4)                                      */
 #define R_ICU_NMICLR_VBATTCLR_Msk        (0x10UL)       /*!< VBATTCLR (Bitfield-Mask: 0x01)                        */
 #define R_ICU_NMICLR_LVD2CLR_Pos         (3UL)          /*!< LVD2CLR (Bit 3)                                       */
 #define R_ICU_NMICLR_LVD2CLR_Msk         (0x8UL)        /*!< LVD2CLR (Bitfield-Mask: 0x01)                         */
 #define R_ICU_NMICLR_LVD1CLR_Pos         (2UL)          /*!< LVD1CLR (Bit 2)                                       */
 #define R_ICU_NMICLR_LVD1CLR_Msk         (0x4UL)        /*!< LVD1CLR (Bitfield-Mask: 0x01)                         */
 #define R_ICU_NMICLR_WDTCLR_Pos          (1UL)          /*!< WDTCLR (Bit 1)                                        */
 #define R_ICU_NMICLR_WDTCLR_Msk          (0x2UL)        /*!< WDTCLR (Bitfield-Mask: 0x01)                          */
 #define R_ICU_NMICLR_IWDTCLR_Pos         (0UL)          /*!< IWDTCLR (Bit 0)                                       */
 #define R_ICU_NMICLR_IWDTCLR_Msk         (0x1UL)        /*!< IWDTCLR (Bitfield-Mask: 0x01)                         */
 #define R_ICU_NMICLR_TZFCLR_Pos          (13UL)         /*!< TZFCLR (Bit 13)                                       */
 #define R_ICU_NMICLR_TZFCLR_Msk          (0x2000UL)     /*!< TZFCLR (Bitfield-Mask: 0x01)                          */
 #define R_ICU_NMICLR_CPECLR_Pos          (15UL)         /*!< CPECLR (Bit 15)                                       */
 #define R_ICU_NMICLR_CPECLR_Msk          (0x8000UL)     /*!< CPECLR (Bitfield-Mask: 0x01)                          */
/* =========================================================  NMICR  ========================================================= */
 #define R_ICU_NMICR_NFLTEN_Pos           (7UL)          /*!< NFLTEN (Bit 7)                                        */
 #define R_ICU_NMICR_NFLTEN_Msk           (0x80UL)       /*!< NFLTEN (Bitfield-Mask: 0x01)                          */
 #define R_ICU_NMICR_NFCLKSEL_Pos         (4UL)          /*!< NFCLKSEL (Bit 4)                                      */
 #define R_ICU_NMICR_NFCLKSEL_Msk         (0x30UL)       /*!< NFCLKSEL (Bitfield-Mask: 0x03)                        */
 #define R_ICU_NMICR_NMIMD_Pos            (0UL)          /*!< NMIMD (Bit 0)                                         */
 #define R_ICU_NMICR_NMIMD_Msk            (0x1UL)        /*!< NMIMD (Bitfield-Mask: 0x01)                           */
/* ========================================================  DTCENST  ======================================================== */
 #define R_ICU_DTCENST_ST_Pos             (0UL)          /*!< ST (Bit 0)                                            */
 #define R_ICU_DTCENST_ST_Msk             (0x1UL)        /*!< ST (Bitfield-Mask: 0x01)                              */
/* =======================================================  DTCENSET  ======================================================== */
 #define R_ICU_DTCENSET_SET_Pos           (0UL)          /*!< SET (Bit 0)                                           */
 #define R_ICU_DTCENSET_SET_Msk           (0x1UL)        /*!< SET (Bitfield-Mask: 0x01)                             */
/* =======================================================  DTCENCLR  ======================================================== */
 #define R_ICU_DTCENCLR_CLR_Pos           (0UL)          /*!< CLR (Bit 0)                                           */
 #define R_ICU_DTCENCLR_CLR_Msk           (0x1UL)        /*!< CLR (Bitfield-Mask: 0x01)                             */
/* ========================================================  INTFLAG  ======================================================== */
 #define R_ICU_INTFLAG_IF_Pos             (0UL)          /*!< IF (Bit 0)                                            */
 #define R_ICU_INTFLAG_IF_Msk             (0x1UL)        /*!< IF (Bitfield-Mask: 0x01)                              */
/* =======================================================  SBYEDCR0  ======================================================== */
 #define R_ICU_SBYEDCR0_IWDTED_Pos        (0UL)          /*!< IWDTED (Bit 0)                                        */
 #define R_ICU_SBYEDCR0_IWDTED_Msk        (0x1UL)        /*!< IWDTED (Bitfield-Mask: 0x01)                          */
 #define R_ICU_SBYEDCR0_LVD1ED_Pos        (1UL)          /*!< LVD1ED (Bit 1)                                        */
 #define R_ICU_SBYEDCR0_LVD1ED_Msk        (0x2UL)        /*!< LVD1ED (Bitfield-Mask: 0x01)                          */
 #define R_ICU_SBYEDCR0_IRQ0ED_Pos        (2UL)          /*!< IRQ0ED (Bit 2)                                        */
 #define R_ICU_SBYEDCR0_IRQ0ED_Msk        (0x4UL)        /*!< IRQ0ED (Bitfield-Mask: 0x01)                          */
 #define R_ICU_SBYEDCR0_IRQ1ED_Pos        (3UL)          /*!< IRQ1ED (Bit 3)                                        */
 #define R_ICU_SBYEDCR0_IRQ1ED_Msk        (0x8UL)        /*!< IRQ1ED (Bitfield-Mask: 0x01)                          */
 #define R_ICU_SBYEDCR0_IRQ2ED_Pos        (4UL)          /*!< IRQ2ED (Bit 4)                                        */
 #define R_ICU_SBYEDCR0_IRQ2ED_Msk        (0x10UL)       /*!< IRQ2ED (Bitfield-Mask: 0x01)                          */
 #define R_ICU_SBYEDCR0_IRQ3ED_Pos        (5UL)          /*!< IRQ3ED (Bit 5)                                        */
 #define R_ICU_SBYEDCR0_IRQ3ED_Msk        (0x20UL)       /*!< IRQ3ED (Bitfield-Mask: 0x01)                          */
 #define R_ICU_SBYEDCR0_IRQ4ED_Pos        (6UL)          /*!< IRQ4ED (Bit 6)                                        */
 #define R_ICU_SBYEDCR0_IRQ4ED_Msk        (0x40UL)       /*!< IRQ4ED (Bitfield-Mask: 0x01)                          */
 #define R_ICU_SBYEDCR0_IRQ5ED_Pos        (7UL)          /*!< IRQ5ED (Bit 7)                                        */
 #define R_ICU_SBYEDCR0_IRQ5ED_Msk        (0x80UL)       /*!< IRQ5ED (Bitfield-Mask: 0x01)                          */
 #define R_ICU_SBYEDCR0_IRQ6ED_Pos        (8UL)          /*!< IRQ6ED (Bit 8)                                        */
 #define R_ICU_SBYEDCR0_IRQ6ED_Msk        (0x100UL)      /*!< IRQ6ED (Bitfield-Mask: 0x01)                          */
 #define R_ICU_SBYEDCR0_IRQ7ED_Pos        (9UL)          /*!< IRQ7ED (Bit 9)                                        */
 #define R_ICU_SBYEDCR0_IRQ7ED_Msk        (0x200UL)      /*!< IRQ7ED (Bitfield-Mask: 0x01)                          */
 #define R_ICU_SBYEDCR0_DTCED_Pos         (10UL)         /*!< DTCED (Bit 10)                                        */
 #define R_ICU_SBYEDCR0_DTCED_Msk         (0x400UL)      /*!< DTCED (Bitfield-Mask: 0x01)                           */
 #define R_ICU_SBYEDCR0_SPI00RXED_Pos     (18UL)         /*!< SPI00RXED (Bit 18)                                    */
 #define R_ICU_SBYEDCR0_SPI00RXED_Msk     (0x40000UL)    /*!< SPI00RXED (Bitfield-Mask: 0x01)                       */
 #define R_ICU_SBYEDCR0_UART0ERRED_Pos    (20UL)         /*!< UART0ERRED (Bit 20)                                   */
 #define R_ICU_SBYEDCR0_UART0ERRED_Msk    (0x100000UL)   /*!< UART0ERRED (Bitfield-Mask: 0x01)                      */
 #define R_ICU_SBYEDCR0_IICA0ED_Pos       (26UL)         /*!< IICA0ED (Bit 26)                                      */
 #define R_ICU_SBYEDCR0_IICA0ED_Msk       (0x4000000UL)  /*!< IICA0ED (Bitfield-Mask: 0x01)                         */
 #define R_ICU_SBYEDCR0_UART0RXED_Pos     (27UL)         /*!< UART0RXED (Bit 27)                                    */
 #define R_ICU_SBYEDCR0_UART0RXED_Msk     (0x8000000UL)  /*!< UART0RXED (Bitfield-Mask: 0x01)                       */
 #define R_ICU_SBYEDCR0_ADC12ED_Pos       (31UL)         /*!< ADC12ED (Bit 31)                                      */
 #define R_ICU_SBYEDCR0_ADC12ED_Msk       (0x80000000UL) /*!< ADC12ED (Bitfield-Mask: 0x01)                         */
/* =======================================================  SBYEDCR1  ======================================================== */
 #define R_ICU_SBYEDCR1_RTCED_Pos         (0UL)          /*!< RTCED (Bit 0)                                         */
 #define R_ICU_SBYEDCR1_RTCED_Msk         (0x1UL)        /*!< RTCED (Bitfield-Mask: 0x01)                           */
 #define R_ICU_SBYEDCR1_ITLED_Pos         (1UL)          /*!< ITLED (Bit 1)                                         */
 #define R_ICU_SBYEDCR1_ITLED_Msk         (0x2UL)        /*!< ITLED (Bitfield-Mask: 0x01)                           */
 #define R_ICU_SBYEDCR1_URE0ED_Pos        (7UL)          /*!< URE0ED (Bit 7)                                        */
 #define R_ICU_SBYEDCR1_URE0ED_Msk        (0x80UL)       /*!< URE0ED (Bitfield-Mask: 0x01)                          */
 #define R_ICU_SBYEDCR1_UT0ED_Pos         (8UL)          /*!< UT0ED (Bit 8)                                         */
 #define R_ICU_SBYEDCR1_UT0ED_Msk         (0x100UL)      /*!< UT0ED (Bitfield-Mask: 0x01)                           */
 #define R_ICU_SBYEDCR1_UR0ED_Pos         (9UL)          /*!< UR0ED (Bit 9)                                         */
 #define R_ICU_SBYEDCR1_UR0ED_Msk         (0x200UL)      /*!< UR0ED (Bitfield-Mask: 0x01)                           */
 #define R_ICU_SBYEDCR1_IICA1ED_Pos       (10UL)         /*!< IICA1ED (Bit 10)                                      */
 #define R_ICU_SBYEDCR1_IICA1ED_Msk       (0x400UL)      /*!< IICA1ED (Bitfield-Mask: 0x01)                         */
 #define R_ICU_SBYEDCR1_URE1ED_Pos        (11UL)         /*!< URE1ED (Bit 11)                                       */
 #define R_ICU_SBYEDCR1_URE1ED_Msk        (0x800UL)      /*!< URE1ED (Bitfield-Mask: 0x01)                          */
 #define R_ICU_SBYEDCR1_UT1ED_Pos         (12UL)         /*!< UT1ED (Bit 12)                                        */
 #define R_ICU_SBYEDCR1_UT1ED_Msk         (0x1000UL)     /*!< UT1ED (Bitfield-Mask: 0x01)                           */
 #define R_ICU_SBYEDCR1_UR1ED_Pos         (13UL)         /*!< UR1ED (Bit 13)                                        */
 #define R_ICU_SBYEDCR1_UR1ED_Msk         (0x2000UL)     /*!< UR1ED (Bitfield-Mask: 0x01)                           */
 #define R_ICU_SBYEDCR1_CTSUED_Pos        (16UL)         /*!< CTSUED (Bit 16)                                       */
 #define R_ICU_SBYEDCR1_CTSUED_Msk        (0x10000UL)    /*!< CTSUED (Bitfield-Mask: 0x01)                          */

/* =========================================================================================================================== */
/* ================                                          R_IICA0                                          ================ */
/* =========================================================================================================================== */

